/**
 * @file equation.h
 * @brief Заголовочный файл для структур, используемых при решении квадратного уравнения.
 *
 * @details
 * Этот файл содержит объявления структур, используемых для
 * решения квадратных уравнений вида `ax^2 + bx + c = 0`.
 *
 * Основные структуры:
 * - @ref SquareEquationCoefficient "SquareEquationCoefficient" - Хранит коэффициенты уравнений.
 * - @ref SquareEquationResult "SquareEquationResult" - Хранит результаты решения уравнений.
 *
 * @author Арина Прорешина
 * @date 20.08.2024
 */
#ifndef EQUATION_H
#define EQUATION_H

/**
 * @enum RootNumber
 * @brief Перечисление для представления количества корней квадратного уравнения.
 *
 * @details
 * Это перечисление используется для обозначения количества вещественных корней
 * квадратного уравнения. Оно определяет возможные значения количества корней
 * уравнения в зависимости от дискриминанта и коэффициентов уравнения.
 */
enum RootNumber {
    NoRoots,  /**< Уравнение не имеет вещественных корней. */
    OneRoot,  /**< Уравнение имеет один вещественный корень. */
    TwoRoots, /**< Уравнение имеет два вещественных корня. */
    InfRoots  /**< Уравнение имеет бесконечно много корней. */
};

/**
 * @struct SquareEquationResult
 * @brief Структура для хранения результатов решения квадратного уравнения.
 *
 * @details
 * Эта структура содержит результаты решения квадратного уравнения,
 * а также тип результата, который указывает на количество корней.
 */
struct SquareEquationResult {
    double x1;              /**< Первый корень уравнения */
    double x2;              /**< Второй корень уравнения */
    RootNumber result_type; /**< Тип результата: 0 - нет вещественных корней, 1 - один корень, 2 - два корня, 3 - бесконечно много корней*/
};

/**
 * @struct SquareEquationCoefficient
 * @brief Структура для хранения коэффициентов квадратного уравнения.
 *
 * @details
 * Эта структура содержит коэффициенты уравнения ax^2 + bx + c = 0.
 */
struct SquareEquationCoefficient {
    double a; /**< Коэффициент a */
    double b; /**< Коэффициент b */
    double c; /**< Коэффициент c */
};

#endif // EQUATION_H
