/**
 * @file input.h
 * @brief Заголовочный файл, содержащий функции для ввода данных пользователем.
 *
 * Этот файл определяет функции для работы с вводом чисел и коэффициентов
 * квадратного уравнения от пользователя. Он включает в себя проверку ввода,
 * обработку ошибок и передачу значений в структуру коэффициентов.
 *
 * @details
 * В этом файле содержатся две основные функции:
 * - `get_number_input()` для получения числового ввода.
 * - `get_coefficients()` для получения коэффициентов квадратного уравнения.
 *
 * Также в этом файле определяется константа `ERROR_CODE`, используемая для
 * обозначения кода ошибки, возникающей при некорректном вводе.
 */
#ifndef INPUT_H
#define INPUT_H
#include "equation.h"

/**
 * @constant ERROR_CODE
 * @brief Код ошибки, указывающий на неудачное выполнение операции.
 *
 * Эта константа используется для обозначения ошибки в различных функциях и операциях,
 * где возвращаемое значение -1 сигнализирует о неудачном завершении.
 *
 * @note Константа используется для упрощения обработки ошибок в коде.
 */
const int ERROR_CODE = -1;

/**
 * @brief Получает числовой ввод от пользователя.
 *
 * Эта функция запрашивает у пользователя ввод числового значения и проверяет его корректность.
 *
 * @param[in] value Указатель на переменную, в которую будет записано значение.
 * @param[out] message Сообщение, которое будет отображено пользователю.
 * @return true Если ввод был корректным числом.
 * @return false Если ввод не был числом.
 */
bool get_number_input(double* value, const char* message);

/**
 * @brief Запрашивает ввод коэффициентов квадратного уравнения от пользователя.
 *
 * Функция выводит сообщения для ввода коэффициентов a, b и c, и считывает
 * их значения из стандартного ввода. При успешном вводе возвращает 0,
 * иначе возвращает код ошибки (определённый как ERROR_CODE).
 *
 * @param[out] coeffts Указатель на структуру, в которую будут сохранены введенные коэффициенты.
 *
 * @return Возвращает 0 при успешном вводе всех коэффициентов, иначе возвращает ERROR_CODE.
 */
int get_coefficients(SquareEquationCoefficient* coeffts);

#endif // INPUT_H
