/**
 * @file solution.h
 * @brief Заголовочный файл для работы с результатами решения квадратного уравнения.
 *
 * Этот файл содержит определения и объявления, необходимые для работы с результатами
 * решения квадратных уравнений, включая структуры и функции для хранения и печати
 * корней уравнения.
 *
 * @details
 * В этом файле определены:
 * - @ref RootNumber "RootNumber" — перечисление для обозначения количества корней квадратного уравнения.
 * - @ref SquareEquationResult "SquareEquationResult" — структура для хранения корней уравнения и типа результата.
 * - @ref print_solution "print_solution" — функция для печати результатов решения квадратного уравнения.
 */

#ifndef SOLUTION_H
#define SOLUTION_H

/**
 * @enum RootNumber
 * @brief Перечисление для представления количества корней квадратного уравнения.
 *
 * Это перечисление используется для обозначения количества вещественных корней
 * квадратного уравнения. Оно определяет возможные значения количества корней
 * уравнения в зависимости от дискриминанта и коэффициентов уравнения.
 *
 * @var RootNumber::NoRoots
 * Значение 0: Уравнение не имеет вещественных корней.
 *
 * @var RootNumber::OneRoot
 * Значение 1: Уравнение имеет один вещественный корень.
 *
 * @var RootNumber::TwoRoots
 * Значение 2: Уравнение имеет два вещественных корня.
 *
 * @var RootNumber::InfRoots
 * Значение 3: Уравнение имеет бесконечно много корней (применимо для случая, когда a = 0 и b = 0).
 */
enum RootNumber {
    NoRoots,  /**< Уравнение не имеет вещественных корней. */
    OneRoot,  /**< Уравнение имеет один вещественный корень. */
    TwoRoots, /**< Уравнение имеет два вещественных корня. */
    InfRoots  /**< Уравнение имеет бесконечно много корней. */
};

/**
 * @struct SquareEquationResult
 * @brief Структура для хранения результатов решения квадратного уравнения.
 *
 * Эта структура содержит результаты решения квадратного уравнения,
 * а также тип результата, который указывает на количество корней.
 */
typedef struct {
    double x1;       /**< Первый корень уравнения */
    double x2;       /**< Второй корень уравнения */
    RootNumber result_type; /**< Тип результата: 0 - нет вещественных корней, 1 - один корень, 2 - два корня, 3 - бесконечно много корней*/
} SquareEquationResult;

/**
 * @brief Печатает решение квадратного уравнения.
 *
 * Эта функция принимает структуру SquareEquationResult и печатает соответствующее
 * сообщение в зависимости от типа результата.
 *
 * @param[in] result Указатель на структуру SquareEquationResult, содержащую результаты.
 */
void print_solution(SquareEquationResult result);

#endif // SOLUTION_H
