/**
 * @file comparison_with_zero.h
 * @brief Заголовочный файл функций для сравнения чисел с нулем и проверки их близости.
 *
 * @details
 * Этот файл содержит объявления функций, которые используются для сравнения чисел с нулем или между собой с учетом
 * EPSILON. Эти функции полезны для работы с вещественными числами, где прямое сравнение может быть
 * ненадежным из-за ограниченной точности представления чисел с плавающей точкой.
 *
 * @author Арина Прорешина
 * @date 20.08.2024
 */

#ifndef COMPARISON_WITH_ZERO_H_INCLUDED
#define COMPARISON_WITH_ZERO_H_INCLUDED

/**
 * @brief Константа для определения точности сравнения чисел с плавающей точкой.
 *
 * @details
 * Значение EPSILON используется для определения допустимой погрешности при сравнении чисел
 * с плавающей точкой. Если разница между двумя числами меньше EPSILON, то числа считаются близкими.
 */
const double EPSILON = 1e-6;

/**
 * @brief Сравнивает два числа с плавающей точкой на близость.
 *
 * @details
 * Эта функция определяет, находятся ли два числа x и y на расстоянии, меньшем чем EPSILON, друг от друга.
 * Используется для проверки чисел с плавающей точкой на равенство с учетом возможных погрешностей вычислений.
 *
 * @param[in] x Первое число для сравнения.
 * @param[in] y Второе число для сравнения.
 * @return true, если числа близки друг к другу, иначе false.
 */
bool is_close(double x, double y);

/**
 * @brief Проверяет, является ли число с плавающей точкой нулем.
 *
 * @details
 * Эта функция определяет, находится ли число на расстоянии, меньшем чем EPSILON, от нуля.
 * Используется для проверки, является ли число с плавающей точкой фактически равным нулю, несмотря на возможные
 * вычислительные погрешности.
 *
 * @param[in] value Число для проверки.
 * @return true, если число близко к нулю, иначе false.
 */
bool is_zero(double value);

#endif // COMPARISON_WITH_ZERO_H_INCLUDED
