/**
 * @file error_code.h
 * @brief Заголовочный файл для обозначения кодов ошибок программы.
 *
 * @details
 * Этот файл содержит перечисление кодов ошибок, которые используются для обозначения
 * успешного выполнения программы или ошибки.
 *
 * @author Арина Прорешина
 * @date 20.08.2024
 */
#ifndef ERROR_CODE_H
#define ERROR_CODE_H

/**
 * @enum ErrorCode
 * @brief Коды ошибок для программы.
 *
 * @details
 * Это перечисление содержит коды, которые используются для обозначения
 * успешного выполнения программы или ошибки.
 */
enum ErrorCode{
    SUCCESS = 0,    /**< Успешное выполнение операции. */
    ERROR_CODE = -1 /**< Ошибка выполнения операции. */
};

#endif // ERROR_CODE_H
