/**
 * @file input_output_solver.h
 * @brief Заголовочный файл для ввода и вывода данных в программе решения квадратных уравнений.
 *
 * @details
 * Этот файл содержит объявления функций для ввода коэффициентов квадратного уравнения
 * от пользователя и вывода результатов решения уравнения. Также определяются коды
 * ошибок, используемые в программе.
 *
 * Основные функции:
 * - @ref get_coefficients: Запрашивает ввод коэффициентов у пользователя.
 * - @ref print_solution: Печатает результаты решения уравнения.
 *
 * @author Арина Прорешина
 * @date 20.08.2024
 */
#ifndef INPUT_OUTPUT_SOLVER_H
#define INPUT_OUTPUT_SOLVER_H
#include "solver.h"

/**
 * @brief Запрашивает ввод коэффициентов квадратного уравнения от пользователя.
 *
 * @details
 * Функция выводит сообщения для ввода коэффициентов a, b и c, и считывает
 * их значения из стандартного ввода. При успешном вводе возвращает 0,
 * иначе возвращает код ошибки (определённый как ERROR_CODE).
 *
 * @param[out] coeffts Указатель на структуру, в которую будут сохранены введенные коэффициенты.
 *
 * @return Возвращает 0 при успешном вводе всех коэффициентов, иначе возвращает ERROR_CODE.
 */
int get_coefficients(SquareEquationCoefficient* coeffts);

/**
 * @brief Печатает решение квадратного уравнения.
 *
 * @details
 * Эта функция принимает структуру SquareEquationResult и печатает соответствующее
 * сообщение в зависимости от типа результата.
 *
 * @param[in] result Указатель на структуру SquareEquationResult, содержащую результаты.
 */
void print_solution(SquareEquationResult result);

#endif // INPUT_OUTPUT_SOLVER_H
