/**
 * @file solver.h
 * @brief Заголовочный файл для решения квадратных уравнений.
 *
 * @details
 * Этот файл содержит объявление функции для решения квадратных уравнений вида
 * ax^2 + bx + c = 0. В случае, если коэффициент a равен нулю,
 * функция решает соответствующее линейное уравнение. Также описывается структура,
 * в которую помещаются результаты решения уравнения.
 *
 * @author Арина Прорешина
 * @date 20.08.2024
 */
#ifndef SOLVER_H
#define SOLVER_H
#include "equation.h"

/**
 * @brief Решает квадратное уравнение вида ax^2 + bx + c = 0.
 *
 * @details
 * Эта функция вычисляет корни квадратного уравнения на основе коэффициентов
 * a, b и c. Она также учитывает случай, когда коэффициент a равен нулю, и
 * переходит к решению линейного уравнения вида bx + c = 0.
 *
 * @param[in] coeffts Структура, содержащая коэффициенты квадратного уравнения.
 *                    - `coeffts.a` Коэффициент при x^2.
 *                    - `coeffts.b` Коэффициент при x.
 *                    - `coeffts.c` Свободный член.
 * @return SquareEquationResult Структура, содержащая результат решения уравнения.
 *                              - `result.x1` Первый корень уравнения (действительное число).
 *                              - `result.x2` Второй корень уравнения (действительное число, если существует).
 *                              - `result.result_type` Тип результата:
 *                                - `InfRoots`  Если уравнение имеет бесконечно много решений (когда a = 0, b = 0 и c = 0).
 *                                - `NoRoots`   Если уравнение не имеет решений (когда a = 0, b = 0 и c != 0).
 *                                - `OneRoot`   Если уравнение имеет один корень (когда a = 0, b != 0 или дискриминант равен нулю).
 *                                - `TwoRoots`  Если уравнение имеет два корня (когда дискриминант больше нуля).
 */
SquareEquationResult solve_square_equation(SquareEquationCoefficient coeffts);

#endif // SOLVER_H
