/**
 * @file test_solver.h
 * @brief Заголовочный файл тестирования решения квадратного уравнения.
 *
 * @details
 * Этот файл содержит функции для тестирования алгоритма решения квадратного уравнения.
 * Включены функции для запуска тестов, проверки результатов и вывода информации о пройденных тестах.
 *
 * @author Арина Прорешина
 * @date 20.08.2024
 */
#ifndef TESTMODE_SOLVER_H
#define TESTMODE_SOLVER_H

/**
 * @brief Запускает все тесты для решения квадратного уравнения.
 *
 * @details
 * Эта функция последовательно запускает все тесты, определенные в массиве test_data, и выводит результаты.
 * По завершении работы выводит количество неудачных тестов.
 */
void run_tests();

#endif // TESTMODE_SOLVER_H
