/**
 * @file comparison_with_zero.c
 * @brief Функции для сравнения чисел с нулем и проверки их близости.
 *
 * @details
 * Этот файл содержит функции, которые используются для сравнения чисел с нулем или между собой с учетом
 * EPSILON. Эти функции полезны для работы с вещественными числами, где прямое сравнение может быть
 * ненадежным из-за ограниченной точности представления чисел с плавающей точкой.
 *
 * @author Арина Прорешина
 * @date 20.08.2024
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>
#include "comparison_with_zero.h"

/**
 * @brief Сравнивает два числа с плавающей точкой на близость.
 *
 * @details
 * Эта функция определяет, находятся ли два числа x и y на расстоянии, меньшем чем EPSILON, друг от друга.
 * Используется для проверки чисел с плавающей точкой на равенство с учетом возможных погрешностей вычислений.
 *
 * @param[in] x Первое число для сравнения.
 * @param[in] y Второе число для сравнения.
 * @return true, если числа близки друг к другу, иначе false.
 */
bool is_close(double x, double y) {
    return fabs(x - y) < EPSILON;
}

/**
 * @brief Проверяет, является ли число с плавающей точкой нулем.
 *
 * @details
 * Эта функция определяет, находится ли число на расстоянии, меньшем чем EPSILON, от нуля.
 * Используется для проверки, является ли число с плавающей точкой фактически равным нулю, несмотря на возможные
 * вычислительные погрешности.
 *
 * @param[in] value Число для проверки.
 * @return true, если число близко к нулю, иначе false.
 */
bool is_zero(double value) {
    return fabs(value) < EPSILON;
}
